Repository: ArkDeck/ArkDeck
Catalog: windows/App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# app_navigation_section_device
source: Device
zh_hans: 设备

# app_navigation_section_records
source: Records
zh_hans: 记录

# app_devices_unavailable
source: Device list unavailable
zh_hans: 设备列表不可用

# device_action_recheck
source: Re-check
zh_hans: 重新检测

# device_detail_adoptViaCLI
source: Adoption (durable binding) is performed from the CLI: arkdeck device adopt. This App does not submit adoption.
zh_hans: 接管（建立持久绑定）由 CLI 执行：arkdeck device adopt。本 App 不提交接管操作。

# device_state_ready
source: Ready
zh_hans: 就绪

# device_state_authorizedUnadopted
source: Authorized · not adopted
zh_hans: 已授权 · 未接管

# device_state_needsTrust
source: Needs trust
zh_hans: 需要信任

# device_state_offline
source: Offline
zh_hans: 离线

# device_state_needsRecheck
source: Status needs re-check
zh_hans: 状态待重新确认

# device_fact_target
source: Adopted target
zh_hans: 已接管目标

# device_fact_model
source: Device name / model
zh_hans: 设备名称 / 机型

# device_fact_firmware
source: System version
zh_hans: 系统版本

# device_fact_transport
source: Transport
zh_hans: 传输方式

# hdc_devices_refresh
source: Refresh Devices
zh_hans: 刷新设备

# overview_environment_title
source: Environment
zh_hans: 运行环境

# overview_status_refreshing
source: Refreshing…
zh_hans: 正在刷新……

# overview_section_needsAttention
source: Needs Attention
zh_hans: 需处理事项

# overview_attention_clear
source: Nothing needs attention in the current diagnostics.
zh_hans: 当前诊断中没有需要处理的事项。

# overview_record_recent_title
source: Recent Work
zh_hans: 最近的工作

# overview_record_recent_unavailable_title
source: Runtime history could not be read
zh_hans: 无法读取 Runtime 记录

# overview_record_recent_empty
source: No recent runs yet. Start from a workflow in the sidebar.
zh_hans: 还没有最近运行，请从左侧工作流开始。

# overview_record_state_succeeded
source: Succeeded
zh_hans: 已成功

# overview_record_state_failed
source: Failed
zh_hans: 已失败

# overview_record_state_interrupted
source: Interrupted
zh_hans: 已中断

# overview_record_state_cancelled
source: Cancelled
zh_hans: 已取消

# overview_record_state_inProgress
source: In progress
zh_hans: 进行中

# history_action_refresh
source: Refresh history
zh_hans: 刷新历史

# history_loading
source: Loading Runtime history
zh_hans: 正在加载 Runtime 历史

# history_unavailable_title
source: Runtime History Unavailable
zh_hans: 无法读取 Runtime 历史

# history_unavailable_guidance
source: Start or reconnect ArkDeck Runtime, then refresh the history.
zh_hans: 请启动或重新连接 ArkDeck Runtime，然后刷新历史记录。

# history_empty_title
source: No Runtime Jobs Yet
zh_hans: 尚无 Runtime Job

# history_empty_description
source: ArkDeck Runtime has recorded no Jobs on this host.
zh_hans: ArkDeck Runtime 在本机尚未记录任何 Job。

# history_readOnlyNote
source: History only reads Runtime state. Opening a related tool never submits, cancels, or retries this Job.
zh_hans: History 只读取 Runtime 状态。打开相关工具不会提交、取消或重试此 Job。

# history_state_outcomeUnknownSuffix
source: · outcome unknown
zh_hans: · 结果未知

# history_state_queued
source: Queued
zh_hans: 已排队

# history_state_preflight
source: Preflight
zh_hans: 预检中

# history_state_running
source: Running
zh_hans: 运行中

# history_state_waitingForDevice
source: Waiting for device
zh_hans: 等待设备

# history_state_awaitingRebindConfirmation
source: Awaiting rebind confirmation
zh_hans: 等待重新绑定确认

# history_state_planning
source: Planning
zh_hans: 正在生成计划

# history_state_cancelRequested
source: Cancel requested
zh_hans: 已请求取消

# history_state_cancellingAtSafeBoundary
source: Cancelling at safe boundary
zh_hans: 正在安全边界取消

# history_state_waitingForRecovery
source: Waiting for recovery
zh_hans: 等待恢复

# history_state_reconciling
source: Reconciling
zh_hans: 正在核对

# history_state_resumeAtConfirmedSafeBoundary
source: Resuming at safe boundary
zh_hans: 正从已确认安全边界恢复

# history_state_userAbandonRequested
source: Abandon requested
zh_hans: 已请求放弃

# history_state_finalizing
source: Finalizing
zh_hans: 正在收尾

# history_state_planned
source: Planned
zh_hans: 已生成计划

# history_state_succeeded
source: Succeeded
zh_hans: 成功

# history_state_failed
source: Failed
zh_hans: 失败

# history_state_cancelled
source: Cancelled
zh_hans: 已取消

# history_state_interrupted
source: Interrupted
zh_hans: 已中断

# jobInspector_action_show
source: Show job inspector
zh_hans: 展开 Job 检查器

# jobInspector_action_hide
source: Hide job inspector
zh_hans: 收起 Job 检查器

# jobInspector_action_refresh
source: Refresh jobs
zh_hans: 刷新 Job

# jobInspector_action_openHistory
source: Open History
zh_hans: 打开历史记录

# jobInspector_compact_unavailable
source: Runtime status unavailable
zh_hans: Runtime 状态不可用

# jobInspector_compact_empty
source: No Runtime jobs
zh_hans: 没有 Runtime Job

# jobInspector_compact_activeCount
source: %d active
zh_hans: %d 个进行中

# jobInspector_refreshing
source: Refreshing jobs
zh_hans: 正在刷新 Job

# jobInspector_unavailable_title
source: Runtime status unavailable
zh_hans: Runtime 状态不可用

# jobInspector_unavailable_guidance
source: Start or reconnect ArkDeck Runtime, then refresh jobs.
zh_hans: 启动或重新连接 ArkDeck Runtime，然后刷新 Job。

# jobInspector_empty_title
source: No jobs yet
zh_hans: 尚无 Job

# jobInspector_empty_description
source: Runtime is reachable and has no recorded jobs.
zh_hans: Runtime 可访问，但尚未记录任何 Job。

# jobInspector_select
source: Select a Job
zh_hans: 选择一个 Job

# jobInspector_runtimeFacts
source: Runtime facts
zh_hans: Runtime 事实

# jobInspector_fact_operation
source: Operation
zh_hans: 操作

# jobInspector_fact_target
source: Target
zh_hans: 目标

# jobInspector_fact_recordedState
source: Recorded state
zh_hans: 原始记录状态

# jobInspector_fact_mode
source: Execution mode
zh_hans: 执行模式

# jobInspector_timeline
source: Observed timeline
zh_hans: 已观察时间线

# jobInspector_result_outcomeUnknown
source: The device effect is unknown. Do not treat this Job as finished.
zh_hans: 设备影响未知。不要把此 Job 视为已经完成。

# jobInspector_result_waitingForHuman
source: Runtime stopped at a human-required boundary.
zh_hans: Runtime 已停在需要人工处理的边界。

# job_state_queued
source: Queued
zh_hans: 已排队

# job_state_preflight
source: Preflight
zh_hans: 执行前检查

# job_state_running
source: Running
zh_hans: 正在运行

# job_state_waitingForDevice
source: Waiting for device
zh_hans: 等待设备

# job_state_awaitingRebindConfirmation
source: Awaiting rebind confirmation
zh_hans: 等待重新绑定确认

# job_state_planning
source: Planning
zh_hans: 正在生成计划

# job_state_cancelRequested
source: Stop requested
zh_hans: 已请求停止

# job_state_cancellingAtSafeBoundary
source: Stopping at safe boundary
zh_hans: 正在安全边界停止

# job_state_waitingForRecovery
source: Waiting for recovery
zh_hans: 等待恢复

# job_state_reconciling
source: Reconciling
zh_hans: 正在核对结果

# job_state_resumeAtConfirmedSafeBoundary
source: Safe boundary confirmed
zh_hans: 已确认安全恢复边界

# job_state_userAbandonRequested
source: Archive requested
zh_hans: 已请求结束恢复

# job_state_finalizing
source: Finalizing
zh_hans: 正在完成记录

# job_state_planned
source: Planned
zh_hans: 仅计划

# job_state_succeeded
source: Succeeded
zh_hans: 成功

# job_state_failed
source: Failed
zh_hans: 失败

# job_state_cancelled
source: Stopped
zh_hans: 已停止

# job_state_interrupted
source: Interrupted
zh_hans: 已中断

# device_action_rename
source: Rename…
zh_hans: 重命名…

# device_rename_title
source: Rename device
zh_hans: 重命名设备

# device_rename_message
source: Enter 1–64 characters. This name is shown only in ArkDeck; it does not change the device identity or binding.
zh_hans: 请输入 1–64 个字符。此名称仅用于 ArkDeck 中显示，不会修改设备标识或绑定关系。

# device_rename_field
source: Device name
zh_hans: 设备名称

# device_rename_commit
source: Rename
zh_hans: 重命名

# device_rename_cancel
source: Cancel
zh_hans: 取消

# history_detail_title
source: Job details
zh_hans: Job 详情

# history_detail_select
source: Select a Job to inspect its details. The planned / simulated marker stays with a job permanently, in History and in any export.
zh_hans: 选择一个 Job 以查看详情。planned / simulated 标识永久跟随 Job，包括历史与导出。

# history_detail_loading
source: Loading Job detail
zh_hans: 正在加载 Job 详情

# history_detail_reload
source: Reload details
zh_hans: 重新加载详情

# history_detail_operation
source: Operation
zh_hans: 操作

# history_detail_target
source: Target
zh_hans: 目标

# history_detail_state
source: State
zh_hans: 状态

# history_detail_mode
source: Execution mode
zh_hans: 执行模式

# history_detail_created
source: Created
zh_hans: 创建时间

# history_detail_finished
source: Finished
zh_hans: 结束时间

# history_detail_outcomeUnknown
source: Outcome unknown — this Job's effect on the device was never confirmed.
zh_hans: 结果未知——此 Job 对设备的影响从未被确认。

# history_detail_waitingForHuman
source: Waiting for a person to act.
zh_hans: 等待人工处理。

# history_artifacts_empty
source: No Artifacts were recorded for this Job.
zh_hans: 此 Job 未记录 Artifact。

# history_artifacts_emptyPlanned
source: No captured artifacts: a planned job carries only its plan record, by design.
zh_hans: 无采集产物：planned Job 按设计只含计划记录。

# history_artifacts_export
source: Export…
zh_hans: 导出…

# history_artifacts_exportSensitive
source: Export sensitive Artifact…
zh_hans: 导出敏感 Artifact…

# history_artifacts_exportBoundary
source: Artifact bytes are read in bounded verified chunks. The selected destination stays in the App and is never sent to Runtime.
zh_hans: Artifact 字节通过有界分块读取并校验；所选保存位置仅留在 App 内，不会发送给 Runtime。

# history_artifacts_exportPreview_title
source: Review Artifact export
zh_hans: 检查 Artifact 导出信息

# history_artifacts_exportPreview_message
source: Name: %1$@ Size: %2$@ Privacy: %3$@ SHA-256: %4$@
zh_hans: 名称：%1$@ 大小：%2$@ 隐私级别：%3$@ SHA-256：%4$@

# history_artifacts_exportConfirm
source: Choose save location…
zh_hans: 选择保存位置…

# history_artifacts_exportCancel
source: Cancel
zh_hans: 取消

# history_artifacts_exporting
source: Exporting Artifact
zh_hans: 正在导出 Artifact

# settings_tab_general
source: General
zh_hans: 通用

# settings_tab_toolchains
source: Toolchains
zh_hans: 工具链

# settings_tab_storage
source: Storage
zh_hans: 存储

# settings_tab_trace
source: Trace
zh_hans: 跟踪

# settings_common_refresh
source: Refresh
zh_hans: 刷新

# settings_common_loading
source: Loading settings…
zh_hans: 正在加载设置……

# settings_general_subtitle
source: Customize ArkDeck and review build identity, platform information, and privacy guarantees.
zh_hans: 自定义 ArkDeck，并查看构建身份、平台信息与隐私保证。

# settings_general_build
source: Application
zh_hans: 应用

# settings_general_app
source: Name
zh_hans: 名称

# settings_general_version
source: Version
zh_hans: 版本

# settings_general_platform
source: Platform
zh_hans: 平台

# settings_general_architecture
source: Architecture
zh_hans: 架构

# settings_general_privacy
source: Privacy
zh_hans: 隐私

# settings_general_localFirst
source: Local-first artifacts
zh_hans: 产物默认保存在本地

# settings_general_localFirst_detail
source: Session artifacts stay in the configured local storage root unless you explicitly export them.
zh_hans: 除非你主动导出，否则 Session 产物始终保存在已配置的本地存储目录。

# settings_general_noUpload
source: No automatic diagnostics upload
zh_hans: 不会自动上传诊断信息

# settings_general_noUpload_detail
source: Crashes and Job failures never create or upload a diagnostic bundle automatically.
zh_hans: 崩溃或任务失败都不会自动生成或上传诊断包。

# settings_toolchains_subtitle
source: Inspect the selected HDC executable and its verified server context.
zh_hans: 检查当前选中的 HDC 可执行文件及其已验证的服务端上下文。

# settings_toolchains_path
source: Executable
zh_hans: 可执行文件

# settings_toolchains_source
source: Source
zh_hans: 来源

# settings_toolchains_clientVersion
source: Client version
zh_hans: 客户端版本

# settings_toolchains_daemonVersion
source: Daemon version
zh_hans: 守护进程版本

# settings_toolchains_endpoint
source: Endpoint
zh_hans: 端点

# settings_storage_subtitle
source: Manage the Session root, quota and retention window, and read what each store is actually holding.
zh_hans: 管理 Session 根目录、配额与保留周期，并查看每个存储实际占用了多少。

# settings_storage_runtimeUsage
source: ArkDeck Runtime artifacts
zh_hans: ArkDeck Runtime Artifact

# settings_storage_runtimeUsage_detail
source: These are the bytes ArkDeck Runtime stores for Jobs. Runtime measures and enforces this quota itself; the policy above applies to the Session output root instead.
zh_hans: 这里是 ArkDeck Runtime 为任务保存的 Artifact 字节。该配额由 Runtime 自行计量与执行；上方的策略作用于 Session 输出根，不作用于这里。

# settings_storage_runtimeUnavailable
source: ArkDeck Runtime did not report its artifact usage, so no figure is shown here.
zh_hans: ArkDeck Runtime 未报告 Artifact 用量，因此这里不显示数字。

# settings_storage_sessionUsage
source: Session output root
zh_hans: Session 输出根

# settings_storage_sessionUsage_detail
source: The quota, safety margin and retention window above apply to this root only. Runtime artifacts are stored separately and are not counted here.
zh_hans: 上方的配额、安全余量与保留周期只作用于这个根目录。Runtime Artifact 单独存放，不计入这里。

# settings_storage_root
source: Root
zh_hans: 根目录

# settings_storage_quota
source: Total quota
zh_hans: 总配额

# settings_storage_margin
source: Safety margin
zh_hans: 安全余量

# settings_storage_retention
source: Retention
zh_hans: 保留周期

# settings_storage_currentUsage
source: Stored bytes
zh_hans: 已用空间

# settings_storage_remaining
source: Remaining
zh_hans: 剩余

# settings_storage_runtimeTotal
source: Runtime quota
zh_hans: Runtime 配额

# settings_storage_pinned
source: Pinned Sessions
zh_hans: 已固定 Session

# settings_storage_pinGuarantee
source: Retention cleanup never deletes pinned Sessions.
zh_hans: 保留策略清理绝不会删除已固定的 Session。

# settings_storage_measurementUnavailable
source: Current usage is unavailable. The saved quota and retention policy remain visible above.
zh_hans: 当前用量不可用；已保存的配额与保留策略仍显示在上方。

# jobInspector_action_cancel
source: Request cancellation
zh_hans: 请求取消

# jobInspector_cancel_requested
source: Cancellation requested. Runtime is reaching a safe boundary; wait for its terminal state.
zh_hans: 已请求取消。Runtime 正在到达安全边界，请等待最终状态。

# jobInspector_cancel_refused
source: Cancellation was not confirmed. Refresh the record before trying again.
zh_hans: 取消请求未确认。请刷新记录后重试。

# jobInspector_action_openRecord
source: Open this record
zh_hans: 打开此记录

# history_detail_evidence
source: Execution evidence
zh_hans: 执行证据

# history_value_notReported
source: Not reported
zh_hans: 未报告

# history_evidence_catalog
source: Catalog digest
zh_hans: Catalog 摘要

# history_evidence_binding
source: Binding revision
zh_hans: 绑定修订

# history_evidence_authority
source: Authority
zh_hans: 授权类型

# history_evidence_authorityReference
source: Authority reference
zh_hans: 授权引用

# history_evidence_terminalState
source: Terminal state
zh_hans: 终态

# history_evidence_mode
source: Recorded mode
zh_hans: 记录的模式

# history_evidence_effect
source: Recorded effect
zh_hans: 记录的影响

# history_evidence_firstEvidence
source: First evidence
zh_hans: 首条证据时间

# settings_common_cancel
source: Cancel
zh_hans: 取消

# jobRecovery_humanRequired_title
source: Human action is required
zh_hans: 需要人工处理

# jobRecovery_humanRequired_guidance
source: Review the recorded reason and evidence before continuing through an approved Runtime path.
zh_hans: 请先检查已记录的原因和证据，再通过已批准的 Runtime 路径继续。

# debug_action_cancel
source: Stop after the current step
zh_hans: 当前步骤后停止

# debug_action_refresh
source: Refresh Debug facts
zh_hans: 刷新调试信息

# debug_apps_ability
source: Ability name
zh_hans: Ability 名称

# debug_apps_action_start
source: Start Ability
zh_hans: 启动 Ability

# debug_apps_action_stop
source: Stop process
zh_hans: 停止进程

# debug_apps_action_uninstall
source: Uninstall…
zh_hans: 卸载…

# debug_apps_additional_add
source: Add HAP / HSP…
zh_hans: 添加 HAP / HSP…

# debug_apps_additional_note
source: Choose the entry HAP first. Add up to 16 feature HAPs or HSPs from the same bundle; all packages are installed together. Each file must be 1 byte–64 MiB.
zh_hans: 先选择入口 HAP，再添加同一 Bundle 的 feature HAP 或 HSP，最多 16 个，所有包一起安装。每个文件为 1 字节至 64 MiB。

# debug_apps_additional_remove
source: Remove
zh_hans: 移除

# debug_apps_additional_removeNamed
source: Remove %@
zh_hans: 移除 %@

# debug_apps_additional_title
source: Additional packages (optional)
zh_hans: 附加安装包（可选）

# debug_apps_artifacts_title
source: HAP run Artifacts
zh_hans: HAP 运行 Artifact

# debug_apps_bundle
source: Bundle name
zh_hans: Bundle 名称

# debug_apps_captureDiagnostics
source: Capture bounded HiLog while the app runs
zh_hans: 应用运行时采集有界 HiLog

# debug_apps_chooseHAP
source: Choose entry HAP…
zh_hans: 选择入口 HAP…

# debug_apps_cleanup_retain
source: Retain installed app
zh_hans: 保留已安装应用

# debug_apps_cleanup_uninstall
source: Uninstall after run
zh_hans: 运行后卸载

# debug_apps_cleanupPolicy
source: Cleanup policy
zh_hans: 清理策略

# debug_apps_clearSelection
source: Clear package selection
zh_hans: 清空安装包选择

# debug_apps_diagnosticsDuration
source: Diagnostics duration: %d seconds
zh_hans: 诊断时长：%d 秒

# debug_apps_identity_note
source: Names are validated against the Catalog schema; they are never interpreted as arguments.
zh_hans: 名称按 Catalog schema 校验，绝不会被解释为命令参数。

# debug_apps_identity_title
source: Application identity
zh_hans: 应用身份

# debug_apps_importing
source: Checking and importing packages…
zh_hans: 正在校验并导入安装包…

# debug_apps_install_replace
source: Install or replace
zh_hans: 安装或替换

# debug_apps_installPolicy
source: Install policy
zh_hans: 安装策略

# debug_apps_inventory_debuggable
source: Debuggable
zh_hans: 可调试

# debug_apps_inventory_empty
source: No package inventory
zh_hans: 没有应用清单

# debug_apps_inventory_empty_detail
source: The current target probe returned no package names.
zh_hans: 当前目标探测未返回应用包名。

# debug_apps_inventory_package
source: Package / process
zh_hans: 应用 / 进程

# debug_apps_inventory_title
source: Packages and debuggable processes
zh_hans: 应用与可调试进程

# debug_apps_lifecycle_title
source: Lifecycle request
zh_hans: 生命周期请求

# debug_apps_localOnly
source: The App checks and imports every package in bounded chunks before submitting one Job. Local paths never cross into Runtime.
zh_hans: App 会先逐个校验并分块导入所有安装包，再提交一个 Job。本地路径不会进入 Runtime。

# debug_apps_mutationDetail
source: Install, start, stop, uninstall, and remote staging are device mutations. Every dispatch must bind the durable target revision and consume matching authority.
zh_hans: 安装、启动、停止、卸载与远端暂存均为设备变更。每次 dispatch 必须绑定持久设备 revision 并消费匹配授权。

# debug_apps_mutationScope
source: Device mutation scope is explicit
zh_hans: 设备变更影响范围明确可见

# debug_apps_noHAP
source: No local HAP selected
zh_hans: 尚未选择本地 HAP

# debug_apps_package_title
source: HAP package
zh_hans: HAP 安装包

# debug_apps_plan_title
source: Published operation plan
zh_hans: 已发布 operation 计划

# debug_apps_postRun
source: After the run
zh_hans: 运行结束后

# debug_apps_postRun_running
source: Leave running
zh_hans: 保持运行

# debug_apps_postRun_stopped
source: Stop Ability
zh_hans: 停止 Ability

# debug_apps_run
source: Import and run
zh_hans: 导入并运行

# debug_apps_running
source: Runtime is executing the typed HAP lifecycle…
zh_hans: Runtime 正在执行 typed HAP 生命周期…

# debug_apps_runningCleanupHint
source: Uninstall after run removes the app, so it cannot stay running. Choose Retain installed app to keep observing it.
zh_hans: 运行后卸载会移除应用，无法保持运行。要继续观察应用，请选择“保留已安装应用”。

# debug_apps_selection_duplicatePackage
source: Each package can be selected only once. Remove the duplicate selection.
zh_hans: 同一个安装包只能选择一次，请移除重复选择。

# debug_apps_selection_failed
source: The selected file could not be read.
zh_hans: 无法读取所选文件。

# debug_apps_selection_invalid
source: Choose one .hap entry package.
zh_hans: 请选择一个 .hap 入口包。

# debug_apps_selection_invalidAdditional
source: Choose .hap or .hsp files with basenames containing letters, numbers, dots, underscores or hyphens.
zh_hans: 请选择 .hap 或 .hsp 文件，文件名仅含字母、数字、点、下划线或连字符。

# debug_apps_selection_invalidEntry
source: Choose one entry .hap. Use a basename with letters, numbers, dots, underscores or hyphens.
zh_hans: 请选择一个 .hap 入口包，文件名仅含字母、数字、点、下划线或连字符。

# debug_apps_selection_tooManyPackages
source: Choose at most 16 additional packages.
zh_hans: 附加安装包最多可选 16 个。

# debug_apps_target
source: Exact target
zh_hans: 精确目标设备

# debug_artifacts_abi
source: Artifact ABI
zh_hans: 产物 ABI

# debug_artifacts_abi_observed
source: Read from the signed ELF during validation
zh_hans: 校验时从已签名 ELF 自动读取

# debug_artifacts_advanced
source: Required verification and rollback
zh_hans: 必需的验证与回滚

# debug_artifacts_browseRemote
source: Browse remote .so…
zh_hans: 浏览远端 .so…

# debug_artifacts_bundle
source: Target bundle
zh_hans: 目标 Bundle

# debug_artifacts_bundleInvalid
source: Use a dotted bundle name such as com.example.app.
zh_hans: 请输入 com.example.app 形式的 Bundle 名称。

# debug_artifacts_chooseLibrary
source: Choose local .so…
zh_hans: 选择本地 .so…

# debug_artifacts_destination_detail
source: Name the owning app and library. Runtime derives the app-owned device destination from the published profile; this page never accepts a remote path.
zh_hans: 填写所属应用与动态库名称。Runtime 根据已发布 profile 推导 app-owned 设备目标位置；此页面不接受远端路径。

# debug_artifacts_destination_title
source: Deployment target
zh_hans: 部署目标

# debug_artifacts_logicalName
source: Library name
zh_hans: 动态库名称

# debug_artifacts_logicalNameInvalid
source: Use a lib<name>.so filename with no directory components.
zh_hans: 请输入不含目录的 lib<name>.so 文件名。

# debug_artifacts_noLibrary
source: No local library selected
zh_hans: 尚未选择本地动态库

# debug_artifacts_notVerified
source: Deployment did not reach verified completion
zh_hans: 部署未达到验证完成状态

# debug_artifacts_openLogs
source: Capture logs to verify
zh_hans: 获取日志并验证

# debug_artifacts_planReady
source: Runtime plan is ready for review
zh_hans: Runtime 计划已可检查

# debug_artifacts_policy_required
source: The Native Debug path always verifies the published hash, restarted process, and loaded-library maps. Any failed verification automatically restores and re-verifies the previous library.
zh_hans: Native Debug 路径始终验证发布 hash、重启后的进程与动态库加载 maps；任一验证失败都会自动恢复并复验旧动态库。

# debug_artifacts_preparing
source: Validating the signed ELF and materializing the Runtime plan…
zh_hans: 正在校验已签名 ELF 并生成 Runtime 计划…

# debug_artifacts_preview
source: Validate and review plan
zh_hans: 校验并检查替换计划

# debug_artifacts_productionBoundary
source: Each Job deploys one signed app-owned .so through the published operation. Queues run these Jobs serially, stopping on failure or uncertainty. ELF, ABI, Build ID, hash, backup and readback checks still apply. .abc replacement and standalone device restart remain unavailable.
zh_hans: 每个 Job 通过已发布 operation 部署一个已签名 app-owned .so；队列串行运行，失败或结果不确定时停止。仍执行 ELF、ABI、Build ID、hash、备份与读取验证。.abc 替换和独立设备重启仍不可用。

# debug_artifacts_remoteBindingFailed
source: The artifact was selected, but its server could not be bound to this target.
zh_hans: 远端产物已选择，但无法把该服务器绑定到当前目标。

# debug_artifacts_remoteBrowser_cancel
source: Cancel
zh_hans: 取消

# debug_artifacts_remoteBrowser_choose
source: Use selected library
zh_hans: 使用所选动态库

# debug_artifacts_remoteBrowser_detail
source: Browse folders below the verified build root. Only lib*.so files are shown.
zh_hans: 浏览已验证编译根目录以内的文件夹；这里只显示 lib*.so 文件。

# debug_artifacts_remoteBrowser_directory
source: Directory
zh_hans: 目录

# debug_artifacts_remoteBrowser_empty_detail
source: Add and verify an SSH server in Settings > Servers first.
zh_hans: 请先在“设置 > 服务器”中添加并验证 SSH 服务器。

# debug_artifacts_remoteBrowser_empty_title
source: No remote servers
zh_hans: 尚未配置远端服务器

# debug_artifacts_remoteBrowser_library
source: Native library
zh_hans: 动态库

# debug_artifacts_remoteBrowser_noArtifacts
source: No folders or native libraries here
zh_hans: 此处没有文件夹或动态库

# debug_artifacts_remoteBrowser_openSettings
source: Open Server Settings
zh_hans: 打开服务器设置

# debug_artifacts_remoteBrowser_refresh
source: Refresh directory
zh_hans: 刷新目录

# debug_artifacts_remoteBrowser_root
source: Build root
zh_hans: 编译根目录

# debug_artifacts_remoteBrowser_server
source: Server
zh_hans: 服务器

# debug_artifacts_remoteBrowser_title
source: Remote build artifacts
zh_hans: 远端编译产物

# debug_artifacts_remoteBrowser_up
source: Up
zh_hans: 上一级

# debug_artifacts_reopenPlan
source: Review prepared plan
zh_hans: 检查已准备计划

# debug_artifacts_results_title
source: Publish and verification Artifacts
zh_hans: 发布与验证 Artifact
